colinporth/seggerF7/BSP/stm32746g_mt9d111.cpp
// mt9d111.cpp
//{{{  includes
#include "stm32746g_discovery.h"
#include "stm32746g_discovery_camera.h"
//}}}

DCMI_HandleTypeDef hDcmiHandler;
DMA_HandleTypeDef dmaHandler;
uint32_t cameraCurrentResolution;
cLcd* lcdPtr = nullptr;

extern "C" {
  //{{{
  void DCMI_DMAXferComplete (DMA_HandleTypeDef* hdma) {

    DCMI_HandleTypeDef* hdcmi = (DCMI_HandleTypeDef*)((DMA_HandleTypeDef*)hdma)->Parent;

    if (hdcmi->XferCount != 0) {
      uint32_t tmp = ((hdcmi->DMA_Handle->Instance->CR) & DMA_SxCR_CT);
      if (((hdcmi->XferCount % 2) == 0) && (tmp != 0)) {
        // Update memory 0 address location
        uint32_t tmp = hdcmi->DMA_Handle->Instance->M0AR;
        HAL_DMAEx_ChangeMemory (hdcmi->DMA_Handle, (tmp + (8*hdcmi->XferSize)), MEMORY0);
        hdcmi->XferCount--;
        }

      else if ((hdcmi->DMA_Handle->Instance->CR & DMA_SxCR_CT) == 0) {
        // Update memory 1 address location
        uint32_t tmp = hdcmi->DMA_Handle->Instance->M1AR;
        HAL_DMAEx_ChangeMemory (hdcmi->DMA_Handle, (tmp + (8*hdcmi->XferSize)), MEMORY1);
        hdcmi->XferCount--;
        }
      }

    else if ((hdcmi->DMA_Handle->Instance->CR & DMA_SxCR_CT) != 0)
      // Update memory 0 address location
      hdcmi->DMA_Handle->Instance->M0AR = hdcmi->pBuffPtr;

    else if ((hdcmi->DMA_Handle->Instance->CR & DMA_SxCR_CT) == 0) {
      // Update memory 1 address location
      uint32_t tmp = hdcmi->pBuffPtr;
      hdcmi->DMA_Handle->Instance->M1AR = (tmp + (4*hdcmi->XferSize));
      hdcmi->XferCount = hdcmi->XferTransferNumber;
      }

    // Check if the frame is transferred
    if (hdcmi->XferCount == hdcmi->XferTransferNumber)
      // Enable the Frame interrupt
      __HAL_DCMI_ENABLE_IT (hdcmi, DCMI_IT_FRAME);
    }
  //}}}
  //{{{
  void DCMI_DMAError (DMA_HandleTypeDef* hdma) {

    DCMI_HandleTypeDef* hdcmi = (DCMI_HandleTypeDef*)((DMA_HandleTypeDef*)hdma)->Parent;
    if (hdcmi->DMA_Handle->ErrorCode != HAL_DMA_ERROR_FE)
      lcdPtr->debug (LCD_COLOR_RED, "DCMI DMAerror %x", hdcmi->DMA_Handle->ErrorCode);
    }
  //}}}
  //{{{
  void DCMI_Error (DMA_HandleTypeDef* hdma) {
    lcdPtr->debug (LCD_COLOR_RED, "DCMIerror");
    }
  //}}}

  //{{{
  void DCMI_IRQHandler() {

    uint32_t isr_value = READ_REG (hDcmiHandler.Instance->MISR);
    if ((isr_value & DCMI_FLAG_ERRRI) == DCMI_FLAG_ERRRI) {
      // Synchronization error interrupt
      __HAL_DCMI_CLEAR_FLAG (&hDcmiHandler, DCMI_FLAG_ERRRI);
      hDcmiHandler.DMA_Handle->XferAbortCallback = DCMI_Error;
      HAL_DMA_Abort_IT (hDcmiHandler.DMA_Handle);
      }

    if ((isr_value & DCMI_FLAG_OVRRI) == DCMI_FLAG_OVRRI) {
      // Overflow interrupt
      __HAL_DCMI_CLEAR_FLAG (&hDcmiHandler, DCMI_FLAG_OVRRI);
      hDcmiHandler.DMA_Handle->XferAbortCallback = DCMI_Error;
      HAL_DMA_Abort_IT (hDcmiHandler.DMA_Handle);
      }

    if ((isr_value & DCMI_FLAG_FRAMERI) == DCMI_FLAG_FRAMERI) {
      // frame interrupt, in snapshot mode, disable Vsync, Error and Overrun interrupts
      if ((hDcmiHandler.Instance->CR & DCMI_CR_CM) == DCMI_MODE_SNAPSHOT)
        __HAL_DCMI_DISABLE_IT (&hDcmiHandler, DCMI_IT_LINE | DCMI_IT_VSYNC | DCMI_IT_ERR | DCMI_IT_OVR);
      __HAL_DCMI_DISABLE_IT (&hDcmiHandler, DCMI_IT_FRAME);
      __HAL_DCMI_CLEAR_FLAG (&hDcmiHandler, DCMI_FLAG_FRAMERI);
      lcdPtr->debug (LCD_COLOR_GREEN, "frameIrq");
      }
    }
  //}}}
  void DMA2_Stream1_IRQHandler() { HAL_DMA_IRQHandler (hDcmiHandler.DMA_Handle); }
  }

//{{{
void gpioIrqInit (DCMI_HandleTypeDef* hdcmi, void* Params) {

  __HAL_RCC_DCMI_CLK_ENABLE();
  __HAL_RCC_DMA2_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();

  // Configure DCMI GPIO as alternate function
  GPIO_InitTypeDef gpio_init_structure;
  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull = GPIO_PULLUP;
  gpio_init_structure.Speed = GPIO_SPEED_HIGH;
  gpio_init_structure.Alternate = GPIO_AF13_DCMI;

  gpio_init_structure.Pin = GPIO_PIN_4 | GPIO_PIN_6;
  HAL_GPIO_Init (GPIOA, &gpio_init_structure);

  gpio_init_structure.Pin = GPIO_PIN_3;
  HAL_GPIO_Init (GPIOD, &gpio_init_structure);

  gpio_init_structure.Pin = GPIO_PIN_5 | GPIO_PIN_6;
  HAL_GPIO_Init (GPIOE, &gpio_init_structure);

  gpio_init_structure.Pin = GPIO_PIN_9;
  HAL_GPIO_Init (GPIOG, &gpio_init_structure);

  gpio_init_structure.Pin = GPIO_PIN_9 | GPIO_PIN_10  | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_14;
  HAL_GPIO_Init (GPIOH, &gpio_init_structure);

  // Associate the initialized DMA handle to the DCMI handle
  dmaHandler.Init.Channel             = DMA_CHANNEL_1;
  dmaHandler.Init.Direction           = DMA_PERIPH_TO_MEMORY;
  dmaHandler.Init.PeriphInc           = DMA_PINC_DISABLE;
  dmaHandler.Init.MemInc              = DMA_MINC_ENABLE;
  dmaHandler.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
  dmaHandler.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
  dmaHandler.Init.Mode                = DMA_CIRCULAR;
  dmaHandler.Init.Priority            = DMA_PRIORITY_HIGH;
  dmaHandler.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
  dmaHandler.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
  dmaHandler.Init.MemBurst            = DMA_MBURST_SINGLE;
  dmaHandler.Init.PeriphBurst         = DMA_PBURST_SINGLE;
  dmaHandler.Instance = DMA2_Stream1;
  __HAL_LINKDMA (hdcmi, DMA_Handle, dmaHandler);

  // NVIC configuration for DCMI transfer complete interrupt
  HAL_NVIC_SetPriority (DCMI_IRQn, 0x0F, 0);
  HAL_NVIC_EnableIRQ (DCMI_IRQn);

  // NVIC configuration for DMA2D transfer complete interrupt
  HAL_NVIC_SetPriority (DMA2_Stream1_IRQn, 0x0F, 0);
  HAL_NVIC_EnableIRQ (DMA2_Stream1_IRQn);

  // Configure the DMA stream
  HAL_DMA_Init (hdcmi->DMA_Handle);
  }
//}}}
//{{{
void mt9d111Init (uint16_t DeviceAddr, uint32_t resolution) {

  HAL_Delay (200);

  //  soft reset
  CAMERA_IO_Write16 (DeviceAddr, 0x65, 0xA000); // Bypass the PLL, R0x65:0 = 0xA000,
  CAMERA_IO_Write16 (DeviceAddr, 0xF0, 1); // page 1
  CAMERA_IO_Write16 (DeviceAddr, 0xC3, 0x0501); // Perform MCU reset by setting R0xC3:1 = 0x0501.
  CAMERA_IO_Write16 (DeviceAddr, 0xF0, 0); // page 0
  CAMERA_IO_Write16 (DeviceAddr, 0x0D, 0x0021); // Enable soft reset by setting R0x0D:0 = 0x0021. Bit 0 is used for the sensor core reset
  CAMERA_IO_Write16 (DeviceAddr, 0x0D, 0x0000); // Disable soft reset by setting R0x0D:0 = 0x0000.
  HAL_Delay (100);

  CAMERA_IO_Write16 (DeviceAddr, 0x07, 0x00FE); // HBLANK A = 254
  CAMERA_IO_Write16 (DeviceAddr, 0x08, 0x000C); // VBLANK A = 12
  CAMERA_IO_Write16 (DeviceAddr, 0x21, 0x8400); // Read Mode A = 15:binning 10:bothADC

  CAMERA_IO_Write16 (DeviceAddr, 0x05, 0x0204); // HBLANK B = 516
  CAMERA_IO_Write16 (DeviceAddr, 0x06, 0x0014); // VBLANK B = 20
  CAMERA_IO_Write16 (DeviceAddr, 0x20, 0x0300); // Read Mode B = 9:showBorder 8:overSized

  // PLL - M=18,N=1,P=2 - (24mhz/(N+1))*M / 2*(P+1) = 36mhz
  CAMERA_IO_Write16 (DeviceAddr, 0x66, 0x1201); // PLLControl1 -    M:N
  CAMERA_IO_Write16 (DeviceAddr, 0x67, 0x0502); // PLLControl2 - 0x05:P
  CAMERA_IO_Write16 (DeviceAddr, 0x65, 0xA000); // Clock CNTRL - PLL ON
  CAMERA_IO_Write16 (DeviceAddr, 0x65, 0x2000); // Clock CNTRL - USE PLL
  HAL_Delay (100);

  // page 1
  CAMERA_IO_Write16 (DeviceAddr, 0xF0, 1);
  CAMERA_IO_Write16 (DeviceAddr, 0x97, 0x22); // outputFormat - RGB565, swap odd even

