colinporth/seggerF7/BSP/stm32746g_mt9d111.cpp
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x222F); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x009A); // R9 Step = 94
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA408); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x24);   // search_f1_50 = 21
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA409); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x26);   // search_f2_50 = 23
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA40A); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x1D);   // search_f1_60 = 17
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA40B); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x1F);   // search_f2_60 = 19
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2411); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x009A); // R9_Step_60 = 94
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2413); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00B9); // R9_Step_50 = 112
  HAL_Delay (100);
  //}}}

  //{{{  sequencer
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA122); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x01); // EnterPreview: Auto Exposure = 1
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA123); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // EnterPreview: Flicker Detection = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA124); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x01); // EnterPreview: Auto White Balance = 1
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA125); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // EnterPreview: Auto Focus = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA126); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x01); // EnterPreview: Histogram = 1
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA127); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // EnterPreview: Strobe Control  = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA128); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // EnterPreview: Skip Control = 0

  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA129); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x03); // InPreview: Auto Exposure = 3
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA12A); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x02); // InPreview: Flicker Detection = 2
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA12B); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x03); // InPreview: Auto White Balance = 3
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA12C); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // InPreview: Auto Focus = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA12D); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x03); // InPreview: Histogram  = 3
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA12E); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // InPreview: Strobe Control = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA12F); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // InPreview: Skip Control = 0

  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA130); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x04); // ExitPreview: Auto Exposure = 4
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA131); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // ExitPreview: Flicker Detection = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA132); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x01); // ExitPreview: Auto White Balance = 1
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA133); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // ExitPreview: Auto Focus = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA134); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x01); // ExitPreview: Histogram = 1
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA135); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // ExitPreview: Strobe Control = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA136); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // ExitPreview: Skip Control = 0

  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA137); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Capture: Auto Exposure = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA138); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Capture: Flicker Detection = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA139); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Capture: Auto White Balance  = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA13A); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Capture: Auto Focus = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA13B); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Capture: Histogram = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA13C); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Capture: Strobe Control = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA13D); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Capture: Skip Control = 0
  //}}}
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA103); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x06); // Sequencer Refresh Mode
  HAL_Delay (200);
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA103); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x05); // Sequencer Refresh
  HAL_Delay (200);

  //{{{  focus init
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x90B6); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x01); // SFR GPIO suspend

  // enable GPIO0,1 as output, initial value 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x9079); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xFC); // SFR GPIO data direction
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x9071); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // SFR GPIO data b1:0 = 0 GPIO0,1 initial 0

  // use 8bit counter clkdiv 2^(1+2)=8 -> 48mhz -> 6mhz ->> 23.7khz
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x90B0); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x01); // SFR GPIO wg_config b0 = 1 8bit counter
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x90B2); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x02); // SFR GPIO wg_clkdiv b0 = 2

  // GPIO0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x908B); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // SFR GPIO wg_n0 = 0 infinite
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x9081); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 255);  // SFR GPIO wg_t00 = 255 initial off
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x9083); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0);    // SFR GPIO wg_t10 = 0 no on

  // GPIO1
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x908A); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // SFR GPIO wg_n1 = 0 infinite
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x9080); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xFF); // SFR GPIO wg_t01 = 255 max initial on
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x9082); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // SFR GPIO wg_t11 = 0 no off

  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x90B5); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // SFR GPIO reset
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x90B6); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // SFR GPIO suspend
  //}}}

  BSP_CAMERA_Preview();
  }
//}}}

