colinporth/seggerF7/BSP/stm32746g_mt9d111.cpp
//{{{
HAL_StatusTypeDef dcmiInit (DCMI_HandleTypeDef* hdcmi) {

  // Configures the HS, VS, DE and PC polarity
  hdcmi->Instance->CR &= ~(DCMI_CR_PCKPOL | DCMI_CR_HSPOL  | DCMI_CR_VSPOL  | DCMI_CR_EDM_0 |
                           DCMI_CR_EDM_1  | DCMI_CR_FCRC_0 | DCMI_CR_FCRC_1 | DCMI_CR_JPEG  |
                           DCMI_CR_ESS | DCMI_CR_BSM_0 | DCMI_CR_BSM_1 | DCMI_CR_OEBS |
                           DCMI_CR_LSM | DCMI_CR_OELS);
  hdcmi->Instance->CR |=  (uint32_t)(hdcmi->Init.SynchroMode | hdcmi->Init.CaptureRate |
                                     hdcmi->Init.VSPolarity  | hdcmi->Init.HSPolarity  |
                                     hdcmi->Init.PCKPolarity | hdcmi->Init.ExtendedDataMode |
                                     hdcmi->Init.JPEGMode | hdcmi->Init.ByteSelectMode |
                                     hdcmi->Init.ByteSelectStart | hdcmi->Init.LineSelectMode |
                                     hdcmi->Init.LineSelectStart);

  // Enable Error and Overrun interrupts
  __HAL_DCMI_ENABLE_IT (hdcmi, DCMI_IT_ERR | DCMI_IT_OVR);
  return HAL_OK;
  }
//}}}
//{{{
HAL_StatusTypeDef dcmiStart (DCMI_HandleTypeDef* hdcmi, uint32_t DCMI_Mode, uint32_t pData, uint32_t Length) {

  // Enable DCMI by setting DCMIEN bit
  __HAL_DCMI_ENABLE (hdcmi);

  // Configure the DCMI Mode
  hdcmi->Instance->CR &= ~(DCMI_CR_CM);
  hdcmi->Instance->CR |= (uint32_t)(DCMI_Mode);

  hdcmi->DMA_Handle->XferCpltCallback = DCMI_DMAXferComplete;
  hdcmi->DMA_Handle->XferErrorCallback = DCMI_DMAError;
  hdcmi->DMA_Handle->XferAbortCallback = NULL;

  // Reset transfer counters value
  hdcmi->XferCount = 0;
  hdcmi->XferTransferNumber = 0;

  if (Length <= 0xFFFF)
    // Enable the DMA Stream
    HAL_DMA_Start_IT (hdcmi->DMA_Handle, (uint32_t)&hdcmi->Instance->DR, (uint32_t)pData, Length);
  else {
    // DCMI_DOUBLE_BUFFER Mode, Set the DMA memory1 conversion complete callback
    hdcmi->DMA_Handle->XferM1CpltCallback = DCMI_DMAXferComplete;

    // Initialize transfer parameters
    hdcmi->XferCount = 1;
    hdcmi->XferSize = Length;
    hdcmi->pBuffPtr = pData;

    // Get the number of buffer
    while (hdcmi->XferSize > 0xFFFF) {
      hdcmi->XferSize = hdcmi->XferSize / 2;
      hdcmi->XferCount = hdcmi->XferCount * 2;
      }

    hdcmi->XferCount = hdcmi->XferCount - 2;
    hdcmi->XferTransferNumber = hdcmi->XferCount;
    uint32_t memAddress2 = (uint32_t)(pData + (4*hdcmi->XferSize));

    // Start DMA multi buffer transfer
    HAL_DMAEx_MultiBufferStart_IT (hdcmi->DMA_Handle, (uint32_t)&hdcmi->Instance->DR, (uint32_t)pData, memAddress2, hdcmi->XferSize);
    }

  // Enable Capture
  hdcmi->Instance->CR |= DCMI_CR_CAPTURE;

  return HAL_OK;
  }
//}}}
//{{{
void dcmiConfigCrop (DCMI_HandleTypeDef* hdcmi, uint32_t X0, uint32_t Y0, uint32_t XSize, uint32_t YSize) {

  hdcmi->Instance->CWSIZER = XSize | (YSize << DCMI_CWSIZE_VLINE_Pos);
  hdcmi->Instance->CWSTRTR = X0 | (Y0 << DCMI_CWSTRT_VST_Pos);
  hdcmi->Instance->CR |= (uint32_t)DCMI_CR_CROP;
  }
//}}}
//{{{
void dcmiDisableCrop (DCMI_HandleTypeDef* hdcmi) {

  hdcmi->Instance->CR &= ~(uint32_t)DCMI_CR_CROP;
  }
//}}}

// external
//{{{
uint32_t BSP_CAMERA_Init (cLcd* lcd, uint32_t Resolution) {

  lcdPtr = lcd;

  // init camera i2c, readBack id
  CAMERA_IO_Init();
  CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xF0, 0);
  uint32_t readBack = CAMERA_IO_Read16 (CAMERA_I2C_ADDRESS_MT9D111, 0);
  lcdPtr->debug (LCD_COLOR_YELLOW, "cameraId %x", readBack);

  gpioIrqInit (&hDcmiHandler, NULL);

  // config DCMI
  DCMI_HandleTypeDef* dcmi = &hDcmiHandler;
  dcmi->Instance = DCMI;
  dcmi->Init.CaptureRate = DCMI_CR_ALL_FRAME;
  dcmi->Init.HSPolarity = DCMI_HSPOLARITY_LOW;
  dcmi->Init.VSPolarity = DCMI_HSPOLARITY_LOW;
  dcmi->Init.SynchroMode = DCMI_SYNCHRO_HARDWARE;
  dcmi->Init.ExtendedDataMode = DCMI_EXTEND_DATA_8B;
  dcmi->Init.PCKPolarity = DCMI_PCKPOLARITY_RISING;
  dcmiInit (dcmi);

  // 480x272 uses cropped 800x600
  if (Resolution == CAMERA_R480x272) {
    mt9d111Init (CAMERA_I2C_ADDRESS_MT9D111, CAMERA_R800x600);
    dcmiConfigCrop (dcmi, (800 - 480)/2, (600 - 272)/2, (480 * 2) - 1, 272 - 1);
    }
  else {
    mt9d111Init (CAMERA_I2C_ADDRESS_MT9D111, Resolution);
    dcmiDisableCrop (dcmi);
    }

  cameraCurrentResolution = Resolution;

  return readBack;
  }
//}}}

//{{{
uint32_t BSP_CAMERA_getXSize() {

  switch (cameraCurrentResolution) {
    case CAMERA_R160x120: return 160;
    case CAMERA_R320x240: return 320;
    case CAMERA_R480x272: return 480;
    case CAMERA_R640x480: return 640;
    case CAMERA_R800x600: return 800;
    case CAMERA_R1600x1200: return 1600;
    default: return 0;
    }
  }
//}}}
//{{{
uint32_t BSP_CAMERA_getYSize() {

  switch (cameraCurrentResolution) {
    case CAMERA_R160x120: return 120;
    case CAMERA_R320x240: return 240;
    case CAMERA_R480x272: return 272;
    case CAMERA_R640x480: return 280;
    case CAMERA_R800x600: return 600;
    case CAMERA_R1600x1200: return 1200;
    default: return 0;
    }
  }
//}}}

//{{{
void BSP_CAMERA_Start (uint8_t* buff, int continuous) {

  dcmiStart (&hDcmiHandler, continuous ? DCMI_MODE_CONTINUOUS : DCMI_MODE_SNAPSHOT,
             (uint32_t)buff, BSP_CAMERA_getXSize() * BSP_CAMERA_getYSize() / 2);
  }
//}}}
//{{{
void BSP_CAMERA_Preview() {
  CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC6, 0xA120); CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC8, 0x00); // Sequencer.params.mode - none
  CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC6, 0xA103); CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC8, 0x01); // Sequencer goto preview A - 800x600
  }
//}}}
//{{{
void BSP_CAMERA_Capture() {
  // use capture B
  CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC6, 0xA120); CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC8, 0x02); // Sequencer.params.mode - capture video
  CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC6, 0xA103); CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC8, 0x02); // Sequencer goto capture B  - 1600x1200
  }
//}}}

//{{{
void BSP_CAMERA_setFocus (int value) {

  CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xF0, 1);

  if (value <= 1) {
    CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC6, 0x9071); CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC8, 0x00); // SFR GPIO data b1:0 = 0 - disable GPIO1
    CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC6, 0x9081); CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC8, 255);  // SFR GPIO wg_t00 = 255 initial off
    CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC6, 0x9083); CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC8, 0);    // SFR GPIO wg_t10 = 0 no on
    }

  else {
    if (value > 254)
      value = 254;

    CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xF0, 1);
    CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC6, 0x9071); CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC8, 0x02);        // SFR GPIO data b1:0 = enable GPIO1
    CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC6, 0x9081); CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC8, 255 - value); // SFR GPIO wg_t00 pwm off
    CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC6, 0x9083); CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC8, value);       // SFR GPIO wg_t10 pwm on
    }
  }
//}}}
